app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY score ASC
---
  def index
    @users = User.order('score ASC')