app/controllers/weeks_controller.rb

  def show
    @scorecards = Scorecard.where(week_id: params['id'].to_i)
---
SELECT "scorecards".* FROM "scorecards" WHERE "scorecards"."week_id" = $1  [["week_id", 1]]

    def set_week
      @week = Week.find(params[:id])
---
SELECT  "weeks".* FROM "weeks" WHERE "weeks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]